---
kind: other
id: Methods.T:Autodesk.Revit.DB.Toposolid
source: html/81929f26-8a57-1e51-b8e5-84478f6a77be.htm
---
# Toposolid Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.